SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/EFR32ZG28/Include/efr32zg28_devinfo.h
/* Bit fields for DEVINFO HFXOCAL */
#define _DEVINFO_HFXOCAL_RESETVALUE                              0xFFFFFF00UL                                 /**< Default value for DEVINFO_HFXOCAL           */
#define _DEVINFO_HFXOCAL_MASK                                    0xFFFFFFFFUL                                 /**< Mask for DEVINFO_HFXOCAL                    */
#define _DEVINFO_HFXOCAL_SHUNTBIASANA_SHIFT                      0                                            /**< Shift value for DEVINFO_SHUNTBIASANA        */
#define _DEVINFO_HFXOCAL_SHUNTBIASANA_MASK                       0xFUL                                        /**< Bit mask for DEVINFO_SHUNTBIASANA           */
#define _DEVINFO_HFXOCAL_SHUNTBIASANA_DEFAULT                    0x00000000UL                                 /**< Mode DEFAULT for DEVINFO_HFXOCAL            */
#define _DEVINFO_HFXOCAL_SHUNTBIASANA_I20UA                      0x00000000UL                                 /**< Mode I20UA for DEVINFO_HFXOCAL              */
#define _DEVINFO_HFXOCAL_SHUNTBIASANA_I30UA                      0x00000001UL                                 /**< Mode I30UA for DEVINFO_HFXOCAL              */
#define _DEVINFO_HFXOCAL_SHUNTBIASANA_I40UA                      0x00000002UL                                 /**< Mode I40UA for DEVINFO_HFXOCAL              */
#define _DEVINFO_HFXOCAL_SHUNTBIASANA_I50UA                      0x00000003UL                                 /**< Mode I50UA for DEVINFO_HFXOCAL              */
#define _DEVINFO_HFXOCAL_SHUNTBIASANA_I60UA                      0x00000004UL                                 /**< Mode I60UA for DEVINFO_HFXOCAL              */
#define _DEVINFO_HFXOCAL_SHUNTBIASANA_I70UA                      0x00000005UL                                 /**< Mode I70UA for DEVINFO_HFXOCAL              */
#define _DEVINFO_HFXOCAL_SHUNTBIASANA_I80UA                      0x00000006UL                                 /**< Mode I80UA for DEVINFO_HFXOCAL              */
#define _DEVINFO_HFXOCAL_SHUNTBIASANA_I90UA                      0x00000007UL                                 /**< Mode I90UA for DEVINFO_HFXOCAL              */
#define _DEVINFO_HFXOCAL_SHUNTBIASANA_I100UA                     0x00000008UL                                 /**< Mode I100UA for DEVINFO_HFXOCAL             */
#define _DEVINFO_HFXOCAL_SHUNTBIASANA_I110UA                     0x00000009UL                                 /**< Mode I110UA for DEVINFO_HFXOCAL             */
#define _DEVINFO_HFXOCAL_SHUNTBIASANA_I120UA                     0x0000000AUL                                 /**< Mode I120UA for DEVINFO_HFXOCAL             */
#define _DEVINFO_HFXOCAL_SHUNTBIASANA_I130UA                     0x0000000BUL                                 /**< Mode I130UA for DEVINFO_HFXOCAL             */
#define _DEVINFO_HFXOCAL_SHUNTBIASANA_I140UA                     0x0000000CUL                                 /**< Mode I140UA for DEVINFO_HFXOCAL             */
#define _DEVINFO_HFXOCAL_SHUNTBIASANA_I150UA                     0x0000000DUL                                 /**< Mode I150UA for DEVINFO_HFXOCAL             */
#define _DEVINFO_HFXOCAL_SHUNTBIASANA_I160UA                     0x0000000EUL                                 /**< Mode I160UA for DEVINFO_HFXOCAL             */
#define _DEVINFO_HFXOCAL_SHUNTBIASANA_I170UA                     0x0000000FUL                                 /**< Mode I170UA for DEVINFO_HFXOCAL             */
#define DEVINFO_HFXOCAL_SHUNTBIASANA_DEFAULT                     (_DEVINFO_HFXOCAL_SHUNTBIASANA_DEFAULT << 0) /**< Shifted mode DEFAULT for DEVINFO_HFXOCAL    */
#define DEVINFO_HFXOCAL_SHUNTBIASANA_I20UA                       (_DEVINFO_HFXOCAL_SHUNTBIASANA_I20UA << 0)   /**< Shifted mode I20UA for DEVINFO_HFXOCAL      */
#define DEVINFO_HFXOCAL_SHUNTBIASANA_I30UA                       (_DEVINFO_HFXOCAL_SHUNTBIASANA_I30UA << 0)   /**< Shifted mode I30UA for DEVINFO_HFXOCAL      */
#define DEVINFO_HFXOCAL_SHUNTBIASANA_I40UA                       (_DEVINFO_HFXOCAL_SHUNTBIASANA_I40UA << 0)   /**< Shifted mode I40UA for DEVINFO_HFXOCAL      */
#define DEVINFO_HFXOCAL_SHUNTBIASANA_I50UA                       (_DEVINFO_HFXOCAL_SHUNTBIASANA_I50UA << 0)   /**< Shifted mode I50UA for DEVINFO_HFXOCAL      */
#define DEVINFO_HFXOCAL_SHUNTBIASANA_I60UA                       (_DEVINFO_HFXOCAL_SHUNTBIASANA_I60UA << 0)   /**< Shifted mode I60UA for DEVINFO_HFXOCAL      */
#define DEVINFO_HFXOCAL_SHUNTBIASANA_I70UA                       (_DEVINFO_HFXOCAL_SHUNTBIASANA_I70UA << 0)   /**< Shifted mode I70UA for DEVINFO_HFXOCAL      */
#define DEVINFO_HFXOCAL_SHUNTBIASANA_I80UA                       (_DEVINFO_HFXOCAL_SHUNTBIASANA_I80UA << 0)   /**< Shifted mode I80UA for DEVINFO_HFXOCAL      */
#define DEVINFO_HFXOCAL_SHUNTBIASANA_I90UA                       (_DEVINFO_HFXOCAL_SHUNTBIASANA_I90UA << 0)   /**< Shifted mode I90UA for DEVINFO_HFXOCAL      */
#define DEVINFO_HFXOCAL_SHUNTBIASANA_I100UA                      (_DEVINFO_HFXOCAL_SHUNTBIASANA_I100UA << 0)  /**< Shifted mode I100UA for DEVINFO_HFXOCAL     */
#define DEVINFO_HFXOCAL_SHUNTBIASANA_I110UA                      (_DEVINFO_HFXOCAL_SHUNTBIASANA_I110UA << 0)  /**< Shifted mode I110UA for DEVINFO_HFXOCAL     */
#define DEVINFO_HFXOCAL_SHUNTBIASANA_I120UA                      (_DEVINFO_HFXOCAL_SHUNTBIASANA_I120UA << 0)  /**< Shifted mode I120UA for DEVINFO_HFXOCAL     */
#define DEVINFO_HFXOCAL_SHUNTBIASANA_I130UA                      (_DEVINFO_HFXOCAL_SHUNTBIASANA_I130UA << 0)  /**< Shifted mode I130UA for DEVINFO_HFXOCAL     */
#define DEVINFO_HFXOCAL_SHUNTBIASANA_I140UA                      (_DEVINFO_HFXOCAL_SHUNTBIASANA_I140UA << 0)  /**< Shifted mode I140UA for DEVINFO_HFXOCAL     */
#define DEVINFO_HFXOCAL_SHUNTBIASANA_I150UA                      (_DEVINFO_HFXOCAL_SHUNTBIASANA_I150UA << 0)  /**< Shifted mode I150UA for DEVINFO_HFXOCAL     */
#define DEVINFO_HFXOCAL_SHUNTBIASANA_I160UA                      (_DEVINFO_HFXOCAL_SHUNTBIASANA_I160UA << 0)  /**< Shifted mode I160UA for DEVINFO_HFXOCAL     */
#define DEVINFO_HFXOCAL_SHUNTBIASANA_I170UA                      (_DEVINFO_HFXOCAL_SHUNTBIASANA_I170UA << 0)  /**< Shifted mode I170UA for DEVINFO_HFXOCAL     */
#define _DEVINFO_HFXOCAL_VTRTRIMANA_SHIFT                        4                                            /**< Shift value for DEVINFO_VTRTRIMANA          */
#define _DEVINFO_HFXOCAL_VTRTRIMANA_MASK                         0xF0UL                                       /**< Bit mask for DEVINFO_VTRTRIMANA             */
#define _DEVINFO_HFXOCAL_VTRTRIMANA_DEFAULT                      0x00000000UL                                 /**< Mode DEFAULT for DEVINFO_HFXOCAL            */
#define DEVINFO_HFXOCAL_VTRTRIMANA_DEFAULT                       (_DEVINFO_HFXOCAL_VTRTRIMANA_DEFAULT << 4)   /**< Shifted mode DEFAULT for DEVINFO_HFXOCAL    */
#define _DEVINFO_HFXOCAL_RESERVED_SHIFT                          8                                            /**< Shift value for DEVINFO_RESERVED            */
#define _DEVINFO_HFXOCAL_RESERVED_MASK                           0xFFFFFF00UL                                 /**< Bit mask for DEVINFO_RESERVED               */
#define _DEVINFO_HFXOCAL_RESERVED_DEFAULT                        0x00FFFFFFUL                                 /**< Mode DEFAULT for DEVINFO_HFXOCAL            */
#define DEVINFO_HFXOCAL_RESERVED_DEFAULT                         (_DEVINFO_HFXOCAL_RESERVED_DEFAULT << 8)     /**< Shifted mode DEFAULT for DEVINFO_HFXOCAL    */

